def goods_analysis(*lol, bonuses=False):
    lol = list(filter(lambda x: x['страна'] == 'Россия', lol))
    if not bonuses:
        bon = []
        for i in lol:
            bon.append({i['название']: int(i['цена']) - int(i['скидка'])})
        print(bon)
        bon = sorted(bon, key=lambda x: bon[x])
        print(bon)


# p1, p2, p3 = 
goods_analysis(
    {'название': 'Молоко Умный молочник', 'страна': 'Россия', 'цена': 65, 'скидка': 10},
    {'название': 'Говядина тушёная Экстра', 'страна': 'Казахстан', 'цена': 150, 'скидка': 20},
    {'название': 'Зелёный горошек Дачный', 'страна': 'Россия', 'цена': 60, 'скидка': 9},
    {'название': 'Говядина тушёная ГОСТ', 'страна': 'Россия', 'цена': 150, 'скидка': 20}
)
# print(*sorted([p1, p2, p3], key=lambda x: x['название']), sep='\n')